src/cf/InformationRegisters/ИдентификаторыИмпортированныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыИмпортированныхПисем</Name>
			<Comment>Идентификаторы импортированных из Outlook писем</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторИсточника</Name>
					<Comment>Идентификатор письма Outlook (EntryID)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Comment>Идентификатор основания (in-reply-to)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыИмпортированныхПисем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Добавляет запись.
//
Процедура ДобавитьЗапись(Письмо, ИдентификаторИсточника, ИдентификаторОснования) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.ИдентификаторИсточника = ИдентификаторИсточника;
	запись.ИдентификаторОснования = ИдентификаторОснования;	
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает идентификатор основания по письму.
//
Функция ПолучитьИдентификаторОснования(Письмо) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Запись.ИдентификаторОснования;
	
КонецФункции

#КонецЕсли
